// Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.

// 5 -> 2, 4
// 8 -> 2, 4, 6, 8

Console.Write("Введите число, и я покажу все чётные числа до этого числа: ");
int n = Convert.ToInt32(Console.ReadLine());
// int res = 1;

// if (n>=1)
// {
//     res +=1;
// }
// while (res <= n)
//     Console.Write($"Все числа {res}");
//     res +=2;
